<div dir="rtl">

<h2 dir="rtl">میلاد پوراله وردی | DevOps Engineer</h2>

</div>

- 📧 milad.alhvrd@gmail.com
- ☎️ 09192444719
- 🎂 Age: 33
- 📍  Location: Tehran, Iran
- 🔗 [Other Contact Links](#-لینکها)

<div dir="rtl">

- [🎯 درباره من](#-درباره-من)
- [💼 سوابق شغلی](#-سوابق-شغلی)
- [🛠 ابزارها و مهارتها](#-ابزارها-و-مهارتها)
- [🎓 تحصیلات](#-تحصیلات)
- [🌐 زبان‌ها](#-زبانها)
- [🚀 پروژه ها](#-پروژه-ها)
- [🔗 لینک‌ها](#-لینکها)

---

## 🎯 درباره من

مهندس DevOps با بیش از ۸ سال تجربه حرفه‌ای در طراحی، پیاده‌سازی و پایداری زیرساخت‌های نرم‌افزاری در مقیاس سازمانی. دارای درک عمیق از مفاهیم تحویل مستمر، اتوماسیون هوشمند، و معماری سیستم‌های پیچیده با تمرکز بر دسترس‌پذیری بالا و کیفیت پایدار سرویس.  
نقش کلیدی در ایجاد و بهبود فرآیندهای توسعه و استقرار محصول ایفا کرده‌ام؛ از بازنگری در معماری زیرساخت و کلاسترینگ تا ایجاد اکوسیستم‌های امن، انعطاف‌پذیر و قابل مانیتور.  
با اشتیاق مداوم به یادگیری و بهینه‌سازی، به‌عنوان نقطه اتصال میان تیم‌های زیرساخت و توسعه عمل می‌کنم؛ با هدف کاهش خطای انسانی، افزایش چرخه تولید نرم‌افزار، و تضمین پایداری سرویس در محیط‌های عملیاتی حساس.  
نگاه من به DevOps صرفاً ابزاری نیست، بلکه راهکاری اصول‌محور برای ساختن سیستم‌هایی قابل اعتماد، مقیاس‌پذیر و متناسب با نیازهای واقعی کسب‌وکار است.


---

## 💼 سوابق شغلی

**متخصص دواپس – شرکت بهسازان ملت**  
*بهمن 1400 تا اکنون – تهران*  
- طراحی پایپلاین CI/CD چندمرحله‌ای (Java, Node.js) با GitOps از Dev تا Prod
- توسعه Helm Charts سفارشی برای استقرار هوشمند در Kubernetes
- اجرای GitOps برای استقرار خودکار در Kubernetes، Docker، Spring Boot، Tomcat، WebSphere و Node.js
- طراحی سیستم مدیریت دارایی اتوماتیک با Ansible-CMDB
- نوشتن اسکریپت‌های اتوماسیون زیرساختی برای بهبود بهره‌وری
- پیاده‌سازی پایش میکروسرویس‌ها با تمرکز بر Observability و Tracing در Kubernetes
- توسعه APIهای اتصال زیرساخت با Python
- ارائه DevOps as a Service به تیم‌ها با Jenkins و Ansible AWX
- نگهداری از سرویسها و سرورها زیرساختی تیم DevOps
- آموزش و مشاوره در بازطراحی و بهبود فرآیندهای DevOps

**مدیر سیستم لینوکس – شرکت بهسازان ملت**  
*آذر 1396 تا بهمن 1400*  
- مدیریت، پشتیبانی و به‌روزرسانی سرورهای SUSE Linux Enterprise در محیط‌های حساس بانکی
- اسکریپت‌نویسی Bash و استفاده از Ansible برای خودکارسازی نصب، کانفیگ و به‌روزرسانی سرویس‌ها
- نگهداری از سرورهای mission-critical با تأکید بر پایداری و مانیتورینگ سیستم
- بهینه‌سازی سرویس‌های لینوکسی (مانند Web, App, DB, MQ) و بهبود کارایی منابع در سرورهای فیزیکی و مجازی
- طراحی و تهیه OVF شخصی سازی شده برای یکپارچگی زیرساخت ها

**مهندس IT – شرکت رامپکو**  
*شهریور 1395 تا آذر 1396*  
- پیاده‌سازی ESX و سرویس‌های ویندوزی مثل AD، DNS، FTP  
- مدیریت زیرساخت مجازی و مانیتورینگ اولیه

**کارشناس Helpdesk – مؤسسه بیوتکنولوژی کشاورزی ایران**  
*دی 1393 تا مرداد 1395*  
- پشتیبانی نرم‌افزار و سخت‌افزار، نصب سیستم‌عامل‌ها و پیکربندی شبکه

---

## 🛠 ابزارها و مهارتها

</div>

- **Infrastructure & Containers:** Linux, Kubernetes، Docker, VMWare
- **Automation & Configuration:** Ansible، Jenkins، Bash، Python
- **CI/CD & GitOps:** GitOps Practice, GitLab CI/CD، ArgoCD, SonarQube, IaC
- **LoadBalancers:** HAProxy، Nginx، Traefik (Loadbalancing, SSL termination)
- **Observability:** Prometheus، Grafana، Loki, Tempo, ELK
- **Other Tools:** MinIO، Keycloak, Istio, Velero, Ansible-AWX
- **Languages:** Python، Bash

<div dir="rtl">

---

## 🎓 تحصیلات

کارشناسی فناوری اطلاعات – دانشگاه غیرانتفاعی صوفی زنجان  
*۱۳۸۹ تا ۱۳۹۳*

---

## 🌐 زبان‌ها

- فارسی: زبان مادری  
- انگلیسی: مسلط در محیط فنی و مستندات  

---

## 🚀 پروژه ها

- [SMS Alertmanager](https://github.com/miladpav/send-sms-alertmanager)
- [Ansible Asset Management CMDB](https://github.com/miladpav/cmdb-stack)
- [Ansible Dynamic Inventory Generator](https://github.com/miladpav/TMWAY)

---

[![miladpav's GitHub stats](https://github-readme-stats.vercel.app/api?username=miladpav&show_icons=true&theme=radical)](#)

## 🔗 لینک‌ها

- LinkedIn: [linkedin.com/in/milad-alahverdi](https://linkedin.com/in/milad-alahverdi)  
- GitHub: [github.com/miladpav](https://github.com/miladpav)
- Telegram: [https://t.me/MilaD_PaV](https://t.me/MilaD_PaV)
- Skype ID: milad.alhvrd_1
- Additional Email: m.p.allahverdi@gmail.com

</div>
